ee230/C8051F/Examples/C8051F93x_92x/F9xx_Imeasure/F9xx_Main.c
//-----------------------------------------------------------------------------
// F9xx_Main.c
//-----------------------------------------------------------------------------
// Copyright 2007 Silicon Laboratories, Inc.
// http://www.silabs.com
//
// Program Description:
//
// This program configures the device to the options selected in Imeasure.h
//
//
// How To Test:
//
// 1) Download code to an 'F93x target board.
// 2) Remove all shorting blocks (except for J11) from the board.
// 3) Disconnect the USB Debug Adapter from the target board. 
// 4) Power Cycle the board (or press the reset switch).
// 4) Measure the current flowing through J17 or H2.
//
//
// Target:         C8051F93x-C8051F90x
// Tool chain:     Keil C51
// Command Line:   None
//
//
// Release 1.2 
//    - Updated to be compatible with Raisonance Toolchain (FB)
//    - 14 APR 2010
//
// Release 1.1
//    - Added support for 'F91x-'F90x devices (FB)
//    - Added options to disable VDD and VBAT Supply Monitors
//    -15 JUL 2009
//
// Release 1.0
//    -Initial Revision (FB)
//    -02 OCT 2008
//

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------

#include <compiler_defs.h>
#include <C8051F912_defs.h>            // SFR declarations

#include "Global_Const.h"
#include "Imeasure.h"
#include "F9xx_Config.h"

//-----------------------------------------------------------------------------
// Constants
//-----------------------------------------------------------------------------
SBIT (SW2,        SFR_P0, 2);          // SW2 == 0 means switch pressed
SBIT (SW3,        SFR_P0, 3);          // SW3 == 0 means switch pressed

#define RTC0CN    0x04                 // RTC address of RTC0CN register                
#define RTC0XCN   0x05                 // RTC address of RTC0XCN register 
#define RTC0XCF   0x06                 // RTC address of RTC0XCF register

//-----------------------------------------------------------------------------
// Variables
//-----------------------------------------------------------------------------

volatile LOCATED_VARIABLE_NO_INIT(DEVICE_ID_16K, U8, code, 0x3FFE);
volatile LOCATED_VARIABLE_NO_INIT(DEVICE_ID_64K, U8, code, 0xFFFE);

#define C8051F930  0x56
#define C8051F931  0x5E
#define C8051F920  0xB1
#define C8051F921  0xB3

#define C8051F912  0xD3
#define C8051F911  0xD2
#define C8051F902  0xD1
#define C8051F901  0xD0

U8 Device_ID = 0x0000;

//-----------------------------------------------------------------------------
// Function Pointer
//-----------------------------------------------------------------------------
#if(COMPILER == KEIL)
void (*Imeasure_Function_Pointer)(void);
#elif(COMPILER == RAISONANCE)
void Imeasure(void);
#endif
//-----------------------------------------------------------------------------
// Function Prototypes
//-----------------------------------------------------------------------------

void OSCILLATOR_Init (void);
void PORT_Init (void);
void Wait_US(U16 us);
void Wait_MS(U16 ms);

void RTC_Init (void);
unsigned char RTC_Read (unsigned char);
void RTC_Write (unsigned char, unsigned char);

//-----------------------------------------------------------------------------
// main() Routine
//-----------------------------------------------------------------------------

void main (void)
{


   PCA0MD &= ~0x40;                    // WDTE = 0 (clear watchdog timer
                                       // enable)
   
   //--------------------------------------------------------------------------
   // Low Power Startup Delay
   //--------------------------------------------------------------------------
   // In one-cell mode, decreasing the MCU power consumption for a short period
   // after Power-On Reset allows the decoupling capacitors time to recharge.
   // This allows the MCU to successfully start up at lower voltages when 
   // the source impedance is very high. Examples of high source impedance 
   // include a battery which is near its end of life or when starting up 
   // while being connected to a current meter.
   
   if(RSTSRC & 0x02 || PMU0CF & 0x10)
   {
      Wait_MS (100);                   // Insert low power delay 
   }

   //--------------------------------------------------------------------------
   // Safety Trap
   //--------------------------------------------------------------------------
   // Create a trap to catch code execution in case we place the device in
   // a state in which we are unable to connect. Holding SW2 down during a 
   // reset will cause the device to enter this trap.

   if( (SW2 == 0) )
   {
      while(1);
   }

   //--------------------------------------------------------------------------
   // Disable VBAT Supply Monitor
   //--------------------------------------------------------------------------
   // The IDE cannot connect to the device when the VBAT supply monitor is 
   // disabled. Insert a 3-5 second delay before disabling the VBAT supply
   // monitor to enable debugging. The proper way to connect to the device
   // when the VBAT supply monitor is disabled is:
   //
   //    1. Trigger any device reset (e.g. reset pin, etc).
   //
   //    2. Within 3-5 seconds (based on delay below), initiate a connection
   //       using the IDE.
    
   #if (DISABLE_VBAT_SUPPLY_MONITOR)

   Wait_MS (3000);

   SFRPAGE = 0x0F;
   PMU0MD |= 0x20; 
   SFRPAGE = 0x00;
   #endif

   //--------------------------------------------------------------------------
   // Disable VDD/DC+ Supply Monitor
   //--------------------------------------------------------------------------
   #if (DISABLE_VDD_SUPPLY_MONITOR)
   VDM0CN = 0x00;
   RSTSRC = 0x00;
   #endif

   //--------------------------------------------------------------------------
   // Determine the Device ID
   //--------------------------------------------------------------------------
   
   // Attempt to read the device ID from address 0xFFFE (for a 64KB device).
   // If the read is successful, the device ID is copied from the Flash location
   // to the <Device_ID> variable. If a Flash Error Reset occurs, we are on 
   // a 16KB or smaller device. The device ID will be available from 0x3FFE.
   if(RSTSRC == 0x40)
   {
      Device_ID = DEVICE_ID_16K;
   } 
   else
   {
      Device_ID = DEVICE_ID_64K;
   }

