ee230/C8051F/Examples/C8051F93x_92x/F9xx_Imeasure/F9xx_Main.c
   //--------------------------------------------------------------------------
   // Optimize One-Cell Mode Operation
   //--------------------------------------------------------------------------
   // These instructions have no effect when operating in two-cell mode
   
   DC0CN = 0x81;                       // Use the large switch and enable
                                       // minimum pulse width

   //DC0CF |= 0x04;                    // Enable 500mA peak current

   if(Device_ID == C8051F912 || Device_ID == C8051F902)
   {
      // Enable Low Power Mode on the DC-DC Converter
      DC0CF |= 0x80;
   } 

   //--------------------------------------------------------------------------
   // MCU Initialization
   //--------------------------------------------------------------------------
   PORT_Init();                        // Initialize Port I/O
   OSCILLATOR_Init ();                 // Initialize Oscillator

   //--------------------------------------------------------------------------
   // Sleep or Suspend Mode
   //--------------------------------------------------------------------------
   #if ((POWER_MODE == SLEEP) || (POWER_MODE == RTCSLEEP) || (POWER_MODE == SUSPEND))
      while(1)
      {
         CLKSEL = 0x14;                // Force the clock select to
                                       // low power oscillator / 2 per
                                       // 'F930/31/20/21 errata recommendation
                                       
         if((CLOCK_SELECTION & 0x07) == PRECISION_OSC)
         {
            REG0CN &= ~0x10;           // Disable precision oscillator bias   
         }   


         while ((CLKSEL & 0x80) == 0); // Wait for divider to be applied                       
         
         FLSCL &= ~0x40;               // Clear the BYPASS bit
         FLWR  =   0x01;               // to enable the one-shot
         
         #if((POWER_MODE == RTCSLEEP) && ((CLOCK_SELECTION & 0x0F) != SMARTCLOCK_OSC))
         RTC_Init();
         #endif
         
         PMU0CF = 0x20;                // Clear all wake-up source flags
         PMU0CF = POWER_MODE;          // Enter the low power mode
      
         #if(POWER_MODE == SLEEP || POWER_MODE == RTCSLEEP)
            NOP();                     // Do not place a breakpoint on
                                       // this instruction if waking up
                                       // from Sleep Mode. Placing a 
                                       // breakpoint here will cause
                                       // the IDE to disconnect.
            
            NOP(); NOP(); NOP();       // For 'F91x-'F90x devices, 4 NOPs
                                       // are required after waking up
                                       // from Sleep mode.
         #endif
         
         if((CLOCK_SELECTION & 0x07) == PRECISION_OSC)
         {
            REG0CN |= 0x10;            // Enable precision oscillator bias   
            Wait_US(4);                // Insert 4uS  delay
         }  
      
         CLKSEL = CLOCK_SELECTION;     // Restore selected system clock
         while ((CLKSEL & 0x80) == 0); // Wait for divider to be applied         

         // Restore the oneshot setting
         #if((SYSCLK > 10000000))              
         FLSCL |= 0x40;                // Set the BYPASS bit
         #endif         

         // If the wake-up source was a falling edge on /RST
         #if(POWER_MODE == SLEEP || POWER_MODE == SUSPEND)
         if(PMU0CF & 0x10)
         {
            Wait_US(15);               // Wait at least 15 us before 
                                       // allowing the MCU to go back
                                       // into the low power mode. 
                                       // This gives the IDE/Debug 
                                       // Adapter time to synchronize
                                       // with the MCU and allows the MCU
                                       // to respond to a Pin Reset.
         }
         #endif
      }
   #endif

   //--------------------------------------------------------------------------
   // Idle Mode
   //--------------------------------------------------------------------------
   #if (POWER_MODE == IDLE)

      while(1)
      {  
         FLSCL &= ~0x40;               // Clear the BYPASS bit
         FLWR  =   0x01;               // to enable the one-shot
         
         PCON = POWER_MODE;

         // Restore the oneshot setting
         #if(SYSCLK > 10000000)              
         FLSCL |= 0x40;                // Set the BYPASS bit
         #endif

      }
   #endif

   //--------------------------------------------------------------------------
   // Stop Mode
   //--------------------------------------------------------------------------
   #if (POWER_MODE == STOP)

      if((CLOCK_SELECTION & 0x07) != PRECISION_OSC)
      {
         REG0CN |= 0x10;               // Enable precision oscillator bias   
         Wait_US(4);                   // Insert 4uS  delay
      }  

      OSCICN |= 0x80;                  // Select precision oscillator as 
      CLKSEL = 0x00;                   // clock source
      while(!(CLKSEL & 0x80));         // Wait for CLKRDY


      PMU0CF = 0x20;                   // Clear wake-up flags to disable
                                       // the low power oscillator

      if(Device_ID == C8051F930 || Device_ID == C8051F931 ||
         Device_ID == C8051F920 || Device_ID == C8051F921   )
      {
         REG0CN &= ~0x10;              // Disable precision oscillator bias
      }                                // if enabled only on 'F93x devices
                                       // Not needed for 'F91x devices
      
      FLSCL &= ~0x40;                  // Clear the BYPASS bit
      FLWR  =   0x01;                  // to enable the one-shot
         
      PCON = POWER_MODE;               // A reset is required to exit this mode

   #endif
      
   //--------------------------------------------------------------------------
   // Normal Mode
   //--------------------------------------------------------------------------
   // Infinite Loop For Measuring Current in Normal Mode
   // Note: Ensure that this loop does not bridge a 64-byte flash row
   // boundary. To ensure the while(1) statement is located on a single
   // row, manually assign its location in Flash.
   #if(COMPILER == KEIL)
   Imeasure_Function_Pointer = IMEASURE_FUNCTION_LOCATION;
   Imeasure_Function_Pointer();
   #elif(COMPILER == RAISONANCE)
   Imeasure();
   #endif

